status/2021/08jan21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>01 January 2021 - 08 January 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">01 January 2021 - 08 January 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0fd0a2b">1. EPICS</a>
<ul>
<li><a href="#org041d7c2">1.1. Continue mapping U3-HV input configuration to SCPI ROUTE commands</a></li>
<li><a href="#org820d8b9">1.2. Exploring alternatives to 'gschem' for abstract schematics</a></li>
</ul>
</li>
<li><a href="#org36e1582">2. Workshop</a>
<ul>
<li><a href="#org745d51b">2.1. Clock weights</a></li>
<li><a href="#orgb493e23">2.2. Drill press bench</a></li>
</ul>
</li>
<li><a href="#org0eeec86">3. Brini Tracker II</a></li>
</ul>
</div>
</div>
<p>
Happy New Year - from Pandemic to Pandemonium
</p>

<div id="outline-container-org0fd0a2b" class="outline-2">
<h2 id="org0fd0a2b"><span class="section-number-2">1.</span> EPICS</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org041d7c2" class="outline-3">
<h3 id="org041d7c2"><span class="section-number-3">1.1.</span> Continue mapping U3-HV input configuration to SCPI ROUTE commands</h3>
</div>
<div id="outline-container-org820d8b9" class="outline-3">
<h3 id="org820d8b9"><span class="section-number-3">1.2.</span> Exploring alternatives to 'gschem' for abstract schematics</h3>
<div class="outline-text-3" id="text-1-2">
<p>
'gschem' appears to have bit-rotted significantly in Fedora, and
doesn't appear to work right when built from source (older schematics
have some wires misplaced). Kicad is great for real parts; I just
don't see a good set of simple abstract symbols out of the
box. xcircuit is a lot closer, but I really don't want to learn
another schematic entry tool if I don't have to. I'll probably just
build some simple abstract symbols for Kicad, maybe with proper
IEEE-91 distinguished symbol proportions. This is an 'EPICS' items
because I wanted to update the U3-HV SCPI input structure diagram
in gschem.
</p>
</div>
</div>
</div>

<div id="outline-container-org36e1582" class="outline-2">
<h2 id="org36e1582"><span class="section-number-2">2.</span> Workshop</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org745d51b" class="outline-3">
<h3 id="org745d51b"><span class="section-number-3">2.1.</span> Clock weights</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Cut down to 1kg.
</p>
</div>
</div>
<div id="outline-container-orgb493e23" class="outline-3">
<h3 id="orgb493e23"><span class="section-number-3">2.2.</span> Drill press bench</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Cleaned off. <b>someone</b> (not me!) left a gallon of muriatic acid on the
bench (since moved outside), which significantly rusted the grinder,
intermittent motion machine, and a bit of a quad box extension cord
and the "Dave Bartlett Memorial" kiln.
</p>
</div>
</div>
</div>

<div id="outline-container-org0eeec86" class="outline-2">
<h2 id="org0eeec86"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
Took <b>way</b> too long to get three display pushbuttons mapped to SAUL
variables. GPS is intermittent and ADCs don't work right. Going back to
U3-HV SCPI because I can use it to debug the peripheral bringup.
</p>

<p>
Some much for a 'quick' project!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
